---
type: DuctPressureDropData
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 20
tags: [revit-api, class]
---

# DuctPressureDropData

`Autodesk.Revit.DB.Mechanical.DuctPressureDropData` · Revit 2024 · 20 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | CategoryId | 2014 | `public ElementId CategoryId { get ; }` |
| Property | Coefficient | 2014 | `public double Coefficient { get ; set ; }` |
| Property | Density | 2014 | `public double Density { get ; }` |
| Property | EquivalentDiameter | 2014 | `[ ObsoleteAttribute ("This property is deprecated in Revit 2024 and may be removed in a later version of Revit. You may instead use the 'HydraulicDiameter' property in the calculation.")] public double EquivalentDiameter` |
| Property | Flow | 2014 | `public double Flow { get ; }` |
| Property | Friction | 2014 | `public double Friction { get ; set ; }` |
| Property | Height | 2014 | `public double Height { get ; }` |
| Property | HydraulicDiameter | 2014 | `public double HydraulicDiameter { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Length | 2014 | `public double Length { get ; }` |
| Property | Level | 2014 | `public SystemCalculationLevel Level { get ; }` |
| Property | PressureDrop | 2014 | `public double PressureDrop { get ; set ; }` |
| Property | ReynoldsNumber | 2014 | `public double ReynoldsNumber { get ; set ; }` |
| Property | Roughness | 2014 | `public double Roughness { get ; }` |
| Property | Shape | 2014 | `public ConnectorProfileType Shape { get ; }` |
| Property | Velocity | 2014 | `public double Velocity { get ; set ; }` |
| Property | VelocityPressure | 2014 | `public double VelocityPressure { get ; set ; }` |
| Property | Viscosity | 2014 | `public double Viscosity { get ; }` |
| Property | WidthOrDiameter | 2014 | `public double WidthOrDiameter { get ; }` |